workshops/m3/artillery/artillery-playwright.yml
config:
  target: https://www.artillery.io
  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 2
      name: Warm up phase
  # Load the Playwright engine:
  engines:
    playwright: {}
  # Path to JavaScript file that defines Playwright test functions
  processor: "./flows.js"
scenarios:
  - engine: playwright